/*

 ■ 감정

 1. 한자
    → 喜 : 기쁠 희  
       怒 : 성낼 노  
       哀 : 슬플 애  
       樂 : 즐길 락  
       情 : 뜻 정  
       懼 : 두려울 구  
       愛 : 사랑 애  
       惡 : 미워할 오  
       欲 : 하고자 할 욕  
       悅 : 기쁠 열  
       歡 : 기쁠 환  
       囍 : 겹경사 희  
       娛 : 즐길 오  
       嗜 : 즐길 시  
       耽 : 빠질 탐  
       微 : 작을 미  
       含 : 머금을 함  
       苦 : 쓸 고  
       冷 : 찰 냉  
       失 : 잃을 실  

       嘲 : 비웃을 조  
       笑 : 웃을 소  
       拍 : 칠 박  
       掌 : 손바닥 장  
       大 : 클 대  
       破 : 깨뜨릴 파  
       顔 : 얼굴 안  
       抱 : 안을 포  
       腹 : 배 복  
       絶 : 끊을 절  
       倒 : 넘어질 도  
       哮 : 울부짖을 효  
       憤 : 성낼 분  
       憂 : 근심할 우  
       慮 : 생각할 려  
       杞 : 나무 기 (杞憂의 기)  
       患 : 근심 환  
       後 : 뒤 후  
       內 : 안 내  
       外 : 바깥 외 

       悲 : 슬플 비  
       慈 : 자비 자  
       鳴 : 울 명  
       慘 : 참혹할 참  
       壯 : 장할 장  
       愴 : 슬퍼할 창  
       戀 : 그리워할 련  
       觀 : 볼 관  
       悼 : 슬퍼할 도  
       惜 : 아낄 석  
       愁 : 근심 수  
       願 : 원할 원  
       傷 : 상할 상  
       切 : 절실할 절  
       痛 : 아플 통  
       而 : 말 이을 이  
       不 : 아닐 불  
       乞 : 빌 걸  
       伏 : 엎드릴 복  
       憎 : 미워할 증  

       偏 : 치우칠 편  
       寵 : 사랑할 총  
       割 : 나눌 할  
       博 : 넓을 박  
       着 : 붙을 착  
       殉 : 순할 순  
       之 : 갈 지  
       重 : 무거울 중  
       敬 : 공경할 경  
       天 : 하늘 천  
       人 : 사람 인  
       堂 : 집 당  
       善 : 착할 선  
       欽 : 공경할 흠  
       追 : 쫓을 추  
       慕 : 그리워할 모  
       常 : 항상 상  
       雲 : 구름 운  
       雨 : 비 우  
       琴 : 거문고 금  

       瑟 : 큰 거문고 슬  
       比 : 견줄 비  
       翼 : 날개 익  
       鳥 : 새 조  
       連 : 잇닿을 련  
       理 : 다스릴 리  
       枝 : 가지 지  
       一 : 한 일  
       片 : 조각 편  
       丹 : 붉을 단  
       心 : 마음 심  
       親 : 친할 친  
       舊 : 옛 구  
       朋 : 벗 붕  
       友 : 친구 우  
       莫 : 없을 막  
       逆 : 거스를 역  
       知 : 알 지  
       音 : 소리 음  
       竹 : 대나무 죽  

       馬 : 말 마  
       故 : 옛 고  
       管 : 피리 관  
       鮑 : 물고기 포  
       交 : 사귈 교  
       金 : 쇠 금  
       蘭 : 난초 란  
       水 : 물 수  
       魚 : 물고기 어  
       忘 : 잊을 망  
       年 : 해 년  
       敵 : 적 적


 2. 단어
    → 희로애락(喜怒哀樂) : 사람이 살아가면서 느끼는 네 가지 감정
       칠정    (七情)     : 유교에서 말하는 사람의 일곱 가지 감정
       미소    (微笑)     : 소리 내지 않고 빙긋이 웃는 것
       함소    (含笑)     : 입가에 웃음을 머금은 것
       고소    (苦笑)     : 뜻밖의 일에 어이없거나 마지못해 짓는 쓴웃음
       냉소    (冷笑)     : 무관심하거나 쌀쌀한 태도로 비웃음
       실소    (失笑)     : 어이가 없어 자기도 모르게 나오는 웃음
       조소    (嘲笑)     : 조롱하여 비웃는 웃음
       박장대소(拍掌大笑) : 손뼉을 치면서 크게 웃는 것
       파안대소(破顔大笑) : 즐거운 표정으로 한바탕 크게 웃음
       포복절도(抱腹絶倒) : 배를 잡고 데굴데굴 구르며 웃는 것
       우려    (憂慮)     : 근심하거나 걱정함
       기우    (杞憂)     : 쓸데없는 걱정
       후환    (後患)     : 어떤 일로 말미암아 뒷날에 생기는 걱정과 근심
       내우외환(內憂外患) : 나라 안팎의 여러 어려운 일들과 근심
       자비    (慈悲)     : 사랑하고 가엾게 여김
       비명    (悲鳴)     : 갑작스러운 위험이나 두려움 때문에 지르는 외마디 소리
       비참    (悲慘)     : 차마 눈으로 볼 수 없을 만큼 슬프고 끔찍함
       비장    (悲壯)     : 슬프면서도 굳세고 꿋꿋함
       비창    (悲愴)     : 마음이 슬프고 서글픔
       
       비련    (悲戀)     : 슬프게 끝나는 사랑
       비관    (悲觀)     : 앞날의 일이 잘 안 될 것으로 봄
       애도    (哀悼)     : 사람의 죽음을 슬퍼함
       애석    (哀惜)     : 슬프고 아깝게 여김
       애환    (哀歡)     : 슬픔과 기쁨
       애수    (哀愁)     : 슬픈 근심
       애원    (哀願)     : 슬프도록 간절히 원함
       애상    (哀傷)     : 슬프고 가슴 아파함
       애절    (哀切)     : 몹시 애처롭고 슬픔
       애통    (哀痛)     : 슬프고 가슴 아파함
       애이불비(哀而不悲) : 속으로는 슬프면서 겉으로는 슬프지 않은 체함
       애걸복걸(哀乞伏乞) : 애처롭게 하소연하면서 빌고 또 빎
       애정    (愛情)     : 사랑하는 마음
       애증    (愛憎)     : 사랑과 미움
       편애    (偏愛)     : 한 쪽으로 치우쳐 사랑함
       총애    (寵愛)     : 남달리 귀엽게 여겨 사랑함
       할애    (割愛)     : 아쉬움을 무릅쓰고 나누어 줌
       박애    (博愛)     : 모든 것을 널리 평등하게 사랑함
       애착    (愛着)     : 어떤 사물과 떨어질 수 없게 아끼고 사랑함
       순애    (殉愛)     : 사랑을 위하여 몸(모든 것)을 바침
       
       애지중지(愛之重之) : 매우 사랑하고 소중히 여김
       경천애인(敬天愛人) : 하늘을 공경하고 사람을 사랑함
       자당    (慈堂)     : 남의 어머니의 존칭
       자선    (慈善)     : 선의를 베풂
       연연    (戀戀)     : 집착하여 미련을 둠
       연적    (戀敵)     : 사랑하는 사람을 빼앗아 가거나 사랑하는 사이를 방해하는 사람
       실연    (失戀)     : 연애에 실패함
       연모    (戀慕)     : 어떤 사람을 사랑하여 몹시 그리워함
       연애    (戀愛)     : 상대방을 서로 애틋하게 사랑하여 사귐
       흠모    (欽慕)     : 마음에 우러러 사모함
       추모    (追慕)     : 죽은 사람을 그리워하고 잊지 않음
       인지상정(人之常情) : 사람이라면 누구나 가지는 보통의 마음이나 감정
       운우지정(雲雨之情) : 남녀 간에 육체적으로 어울리는 정
       막역    (莫逆)     : 서로 너무 잘 알아 상대방의 뜻을 거스를 일이 없는 사이
       지음    (知音)     : 말 없이도 속마음까지 이해하는 벗
       죽마고우(竹馬故友) : 소꿉장난을 같이 하며 자란 어린 시절의 친구
       관포지교(管鮑之交) : 자신을 알아주는 친구
       금란지교(金蘭之交) : 친구 사이의 매우 두터운 정
       수어지교(水魚之交) : 물과 물고기처럼 아주 친밀하여 떨어질 수 없는 사이
       망년지교(忘年之交) : 나이를 따지지 않고 사귀는 벗

 ====================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================

 ■ 고사성어 1

 1. 한자
    → 同 : 같을 동  
       病 : 병 병  
       相 : 서로 상  
       憐 : 불쌍히 여길 련  
       錦 : 비단 금  
       上 : 위 상  
       添 : 더할 첨  
       花 : 꽃 화  
       塞 : 막을 색  
       翁 : 늙은이 옹  
       南 : 남녘 남  
       柯 : 가지 가  
       夢 : 꿈 몽  
       邯 : 고을 한  
       鄲 : 고을 단  
       他 : 다를 타  
       山 : 뫼 산  
       石 : 돌 석  
       拔 : 뽑을 발  
       本 : 근본 본  

       源 : 근원 원  
       以 : 써 이  
       傳 : 전할 전  
       過 : 지날 과  
       猶 : 오히려 유  
       及 : 미칠 급  
       溫 : 따뜻할 온 
       知 : 알 지  
       新 : 새 신  
       畵 : 그림 화  
       龍 : 용 룡  
       點 : 점 점  
       睛 : 눈동자 정  
       磋 : 갈 차  
       琢 : 다듬을 탁  
       磨 : 갈 마  
       曲 : 굽을 곡  
       學 : 배울 학  
       阿 : 언덕 아  
       世 : 세상 세  

       巧 : 공교할 교  
       言 : 말씀 언  
       令 : 하여금 령  
       色 : 얼굴빛 색  
       同 : 같을 동  
       小 : 작을 소  
       異 : 다를 이  
       起 : 일어날 기  
       死 : 죽을 사  
       回 : 돌아올 회  
       生 : 날 생  
       愚 : 어리석을 우  
       公 : 공평할 공  
       移 : 옮길 이  
       附 : 붙을 부  
       和 : 화할 화  
       雷 : 우레 뇌  
       暗 : 어두울 암  
       中 : 가운데 중  
       摸 : 더듬을 모  

       索 : 찾을 색  
       換 : 바꿀 환  
       骨 : 뼈 골  
       奪 : 빼앗을 탈  
       胎 : 아이 밸 태  
       螢 : 반딧불이 형  
       雪 : 눈 설  
       功 : 공 공  
       實 : 열매 실  
       事 : 일 사  
       求 : 구할 구  
       是 : 옳을 시  
       緣 : 인연 연  
       木 : 나무 목  
       食 : 먹을 식   
       兎 : 토끼 토  
       狗 : 개 구  
       烹 : 삶을 팽  
       累 : 포갤 루  
       卵 : 알 란  

       危 : 위태할 위  
       狐 : 여우 호  
       假 : 거짓 가  
       虎 : 범 호  
       威 : 위엄 위  
       麥 : 보리 맥  
       秀 : 빼어날 수  
       嘆 : 탄식할 탄  
       墨 : 먹 묵  
       守 : 지킬 수  
       塗 : 진흙 도  
       炭 : 숯 탄  
       鱗 : 비늘 린


 2. 단어
    → 동병상련(同病相憐) : 처지가 어려운 사람끼리 서로 동정하고 돕는 것
       금상첨화(錦上添花) : 아름다움에 아름다움을 더하는 것
       새옹지마(塞翁之馬) : 인간의 길흉화복은 예측할 수 없다는 뜻
       남가일몽(南柯一夢) : 인생의 덧없음을 말함
       한단지몽(邯鄲之夢) : 인생과 부귀영화의 덧없음을 말하는 꿈
       타산지석(他山之石) : 자기보다 못한 사람이나 남의 잘못된 행실도 자기 수양의 거울로 삼을 수 있다는 뜻
       발본색원(拔本塞源) : 폐단이 되는 근본 원인을 뿌리째 없앤다는 뜻
       이심전심(以心傳心) : 글이나 말을 통하지 않고 서로 마음으로 통하는 것
       과유불급(過猶不及) : 지나친 것은 미치지 못함과 같다
       온고지신(溫故知新) : 과거의 역사나 학문을 먼저 익힌 후 오늘날의 새로운 사실을 습득해야 한다는 뜻
       화룡점정(畵龍點睛) : 사물의 핵심이나 가장 중요한 부분을 완성시킴
       절차탁마(切磋琢磨) : 학문이나 인격을 열심히 갈고 닦다
       곡학아세(曲學阿世) : 학문을 왜곡하여 세상에 아첨하다
       교언영색(巧言令色) : 남의 환심을 사기 위해 말만 번드르르하게 하고 표정만 그럴싸하게 짓는 것
       대동소이(大同小異) : 사소한 부분에서만 다를 뿐 전체적인 면에서 큰 차이가 없는 것
       기사회생(起死回生) : 위기상황에 빠졌다가 반전되어 사태가 호전될 때 쓰는 말
       우공이산(愚公移山) : 도저히 불가능해 보이는 목표라도 끊임없이 노력하면 성취할 수 있다는 뜻
       부화뇌동(附和雷同) : 자기 주견 없이 남의 생각이나 행동을 덩달아 따르는 것
       암중모색(暗中摸索) : 불확실한 일에 대한 해결의 실마리는 찾는 것
       환골탈태(換骨奪胎) : 시문이나 외모를 완전히 바꾸어 이전보다 잘 되게 함

       형설지공(螢雪之功) : 가난 속에서도 열심히 공부해서 이룬 공
       실사구시(實事求是) : 학문을 탐구할 때 실제의 사실을 확인하고 경험함으로써 올바름을 끌어내는 태도
       연목구어(緣木求魚) : 터무니없이 불가능한 일을 비유
       식언    (食言)     : 말만 앞세우고 실천이 따르지 않을 때 쓰는 표현
       토사구팽(兎死狗烹) : 목표를 성취할 때까지는 쓸모가 있었지만 목표를 이루면 버려진다는 의미
       누란지위(累卵之危) : 알을 쌓아 놓은 듯이 매우 위태로운 형세
       호가호위(狐假虎威) : 소인배들이 권력을 등에 지고 멋대로 구는 것
       맥수지탄(麥秀之嘆) : 망한 나라를 한탄할 때 쓰는 말
       묵수    (墨守)     : 자기 소신을 잘 지켜 굴복하지 않는 것
       도탄    (塗炭)     : 진흙탕이나 숯불 속에 빠져 있는 듯이 몹시 곤궁하고 고통스러운 지경
       역린    (逆鱗)     : 임금의 분노를 비유

 ====================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================

 ■ 고사성어 2

 1. 한자
    → 朝 : 아침 조  
       暮 : 저물 모  
       螳 : 사마귀 당  
       螂 : 사마귀 랑  
       拒 : 막을 거  
       轍 : 바퀴자국 철  
       擧 : 들 거  
       兩 : 두 량  
       得 : 얻을 득  
       左 : 왼 좌  
       顧 : 돌아볼 고  
       右 : 오른 우  
       眄 : 곁눈질할 면  
       刻 : 새길 각  
       舟 : 배 주  
       劍 : 칼 검  
       門 : 문 문  
       前 : 앞 전  
       成 : 이룰 성  
       市 : 시장 시  

       羊 : 양 양  
       頭 : 머리 두  
       肉 : 고기 육  
       結 : 맺을 결  
       草 : 풀 초  
       報 : 갚을 보  
       恩 : 은혜 은  
       壟 : 밭두둑 롱  
       斷 : 끊을 단  
       矯 : 바로잡을 교  
       角 : 뿔 각  
       殺 : 죽일 살  
       牛 : 소 우  
       桑 : 뽕나무 상  
       田 : 밭 전  
       碧 : 푸를 벽  
       海 : 바다 해  
       尾 : 꼬리 미  
       蛇 : 뱀 사  
       足 : 발 족  

       似 : 닮을 사  
       非 : 아닐 비  
       面 : 얼굴 면  
       楚 : 초나라 초  
       歌 : 노래 가  
       背 : 등 배  
       水 : 물 수  
       陣 : 진칠 진  
       勢 : 기세 세  
       彌 : 두루 미  
       縫 : 꿰맬 봉  
       百 : 일백 백  
       聞 : 들을 문  
       如 : 같을 여  
       見 : 볼 견  
       鷄 : 닭 계  
       肋 : 갈비 륵  
       傍 : 곁 방  
       若 : 같을 약  
       無 : 없을 무  

       人 : 사람 인  
       泣 : 울 읍  
       斬 : 벨 참  
       謖 : 일어날 속  
       吳 : 오나라 오  
       越 : 넘을 월  
       桃 : 복숭아 도  
       園 : 동산 원  
       義 : 옳을 의  
       耳 : 귀 이  
       東 : 동녘 동  
       風 : 바람 풍  
       口 : 입 구  
       蜜 : 꿀 밀  
       廬 : 오두막 려  
       指 : 가리킬 지  
       鹿 : 사슴 록  
       爲 : 할 위  
       群 : 무리 군  
       鶴 : 학 학  

       難 : 어려울 난  
       兄 : 형 형  
       弟 : 아우 제  
       囊 : 주머니 낭  
       錐 : 송곳 추  
       糟 : 지게미 조  
       糠 : 겨 강  
       妻 : 아내 처

 2. 단어
    → 조삼모사(朝三暮四) : 눈 앞에 보이는 차이만 알고 결과가 같은 것은 모르는 것을 풍자
       당랑거철(螳螂拒轍) : 즉 자신의 역량을 생각하지 못하고 무모하게 강한 상대에게 덤비는 행위를 빗댄 말
       일거양득(一擧兩得) : 한 가지 일을 통해 두 가지 이익을 얻는 것
       좌고우면(左顧右眄) : 좌우의 눈치를 살피면서 결정을 내리지 못함
       각주구검(刻舟求劍) : 고지식하고 완고하거나 세상 물정에 어두울 때 쓰는 말
       문전성시(門前成市) : 출입하는 사람이 많아 붐비는 광경
       양두구육(羊頭狗肉) : 겉으로는 좋은 간판을 내걸지만 속으로는 나쁜 물건을 판다는 뜻
       결초보은(結草報恩) : 죽은 후에라도 잊지 않고 은혜를 갚음
       농단    (壟斷)     : 간교한 수단으로 이익을 독점함을 의미
       교각살우(矯角殺牛) : 결점이나 흠을 고치려다 수단이 지나쳐 도리어 일을 그르침
       상전벽해(桑田碧海) : 세상이 몰라볼 정도로 심하게 변한 것을 이름
       용두사미(龍頭蛇尾) : 처음 시작할 땐 화려하나 끝으로 갈수록 보잘것 없어진다는 뜻
       사족    (蛇足)     : 말이나 행동을 덧붙임으로써 일을 그르칠 때 쓰는 말
       사이비  (似而非)   : 겉으로는 비슷하지만 근본적으로는 아주 다른 것
       사면초가(四面楚歌) : 완전히 궁지에 몰려 도저히 빠져나갈 수 없는 상황
       배수진  (背水陣)   : 더 이상 물러날 곳이 없다는 뜻
       파죽지세(破竹之勢) : 전쟁이나 운동 경기에서 상대 진영을 거침없는 기세로 쳐들어 감을 의미
       미봉    (彌縫)     : 일시적인 임기응변책이나 자신의 결점을 눈가림으로 넘기려는 술책
       백문불..(百聞不..) : 말로만 듣는 것보다 직접 체험해 보는 것이 가장 확실하다는 뜻
       계륵    (鷄肋)     : 별로 쓸모없지만 버리기에는 아까운 것

       방약무인(傍若無人) : 주변의 눈을 무시하고 제멋대로 행동하는 것
       읍참마속(泣斬馬謖) : 법을 공정히 지키기 위해 사사로운 정을 버리는 것을 뜻함
       오월동주(吳越同舟) : 원수나 사이가 좋지 않은 사람이 함께 있는 경우
       도원결의(桃園結義) : 도원에서 의형제를 맺다
       마이동풍(馬耳東風) : 무관심하다가 남의 말을 전혀 귀담아 듣지 않을 때
       구밀복검(口蜜腹劍) : 말을 꿀같이 달콤하게 하지만, 속으로는 음흉한 생각을 품고 있는 것
       삼고초려(三顧草廬) : 사람을 맞이할 때 모든 정성을 다한다는 뜻
       지록위마(指鹿爲馬) : 윗사람을 농락하여 권력을 멋대로 휘두르는 것
       군계일학(群鷄一鶴) : 수많은 사람 가운데서 걸출하게 뛰어난 사람
       난형난제(難兄難弟) : 사물의 우열을 가릴 수 없을 때
       낭중지추(囊中之錐) : 걸출한 인재는 드러나게 마련이라는 뜻
       조강지처(糟糠之妻) : 곤궁할 때부터 고생을 함께 한 아내

*/