/*

 ■ 4장

 1. 중국의 술 문화와 한국의 술 문화를 비교 설명해 보세요.
	→ 우리나라 : 빈 잔에 술을 따른다.
				  건배 이후 자유롭게 마신다.

	   중국 : 잔을 항상 가득 채워놓는다.
			  건배 이후 원샷한다.

	→ 중국의 회사는 모두 국가 소유 : 술의 라벨이 국호 선언 이후로 바뀌지 않았다.

	→ 분류
	   → 바이주 : 마오타이, 우량에
	      황주 : 샤오싱 지방에서 주조
		  혼성주


 2. 발효의 정도에 의해 차를 분류해 보세요.
	→ 불발효 : 뤼차
	   경발효 : 바이차
	   반발효 : 칭차
	   전발효 : 훙차
	   후발효 : 황차, 헤이차

	→ 자사호의 특징
	   → 차의 진액을 흡수하여 축적한다.
		  뜨거운 물로 2~3번 씻어 낸다면 잡냄새가 없어진다.
		  차향을 뺏거나 찻물을 식게 하지 않는다.
	      온도의 적응력이 좋고, 열의 전도성이 낮다.
		  유약을 사용하지 않아 길들일 수 있다.

	→ 중국인은 보온병에 차를 담아 마시는 경우가 많다.
	   중국인은 음식을 매우 존중하여 다른 지역에 가면 항상 음식과 차를 맛본다.

 ====================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================

 ■ 5장

 1. 춘제, 위안샤오제, 돤우제, 중추제의 풍습을 설명해 보세요.
    → 중화인민공화국 초기에 금지한 것 : 자신들의 전통
										 → 춘절은 사라지지 않았다.
										    → 자오쯔를 만들어 먹는다.
											   세벳돈을 빨간 봉투에 넣어서 준다.
											   복, 춘을 거꾸로 붙이기도 한다.

										 → 중추절은 사라졌다.
										    → 뇌물 문제 심각

	→ 노동절(5.1) : 사회주의의 원칙에 따라 가장 중요한 계급인 노동자의 날

	   국경절(10.1) : 사회주의를 택해 인민을 해방하고 중화인민공화국을 건국한 날


 2. 중국의 혼인풍습에 대해 설명해 보세요.
    → 중화인민공화국 초기에 금지한 것 : 서양 문화
										 → 결혼식을 수행하지 않고, 혼인 신청 후 결혼증을 발급 받는다.
										 
										 → 오늘날에는 과거의 영광을 되찾기 위해 서양 문화와 자신들의 전통 부활
										    → 결혼식을 많이 하며, 축의금을 빨간 봉투에 넣어서 준다.


 3. 중국의 모바일 결제 방식에 대해 서술해보고 우리나라와 비교해 보세요.
    → 진시황 : 화폐 통일

	   신해혁명 : 영국식 화폐와 매우 유사한 화폐 발행
	   
	   1949년 : 중화인민공화국 건국
				→ 마오쩌둥의 업적을 강조하기 위해 모든 화폐에 마오쩌둥을 각인
	   
	   오늘날 : 위챗페이, 츠푸바오 등의 모바일 결제 방식

 ====================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================

 ■ 6장

 1. 청 왕조의 쇠퇴부터 중화인민공화국의 건설까지의 과정을 제 1, 2차 국공합작을 중심으로 설명해 보세요.
    → 1. 쑨원의 신해혁명으로 청 왕조가 쇠퇴하고, 국민당이 설립됨
	   
	   2. 천두슈의 공산당 설립
		  → 쑨원은 국민당과 공산당이 협력해야 한다 생각
	   
	   3. 쑨원이 죽고 장제스가 뒤를 이음
	      → 장제스는 반공 사상을 가져 국민당과 공산당 간의 내전 발생

	   4. 공산당의 대장정 시작
	      → 그 과정에서 지주를 죽이고 노동자 계급에게 지지를 얻음

	   5. 일본이 중국을 침공
		  → 국공합작 시작, 장제스는 일본이 물러날 것이라 예측하여 항일 운동에 큰 힘을 쏟지 않음

	   6. 일본의 철수
		  → 내전 재개

	   7. 마오쩌둥이 소련의 지원군이 올 때까지 버팀
	      → 장제스는 오늘날의 대만으로 피난

	   8. 2차 대전 이후 여러 나라가 중화민국과 연을 끊고 중화인민공화국과 국교를 맺음
	      → 중화민국은 대만이 됨
	   

 2. 대약진 운동의 개념과 실패 이유를 서술해 보세요.
    → 사유 재산을 인정하지 않음
       → 토지개혁 : 토지를 몰수하고 국가에서 분배
		   		     도시에서는 기업 몰수
				     → 인구의 대부분을 차지하던 노동자의 지지 UP
				        → 시작은 순수했으나, 점차 공산당의 권력이 높아지게 된다.
					       더 나아가 노력에 따른 차등이 없어 모두가 일을 하지 않게 된다.


 3. 문화대혁명의 발단, 전개, 종결 과정을 서술해 보세요.
	→ 마오쩌둥은 소련의 영향력에서 벗어나고 싶어했다.
	   → 대약진 운동의 실패 원인이 인민의 문화가 부족했기 때문이라 판단
	      → 대학을 없애고 모두를 노동자로 만듦
		  → 홍위병을 이용해 반대파 숙청
	   

 4. 덩샤오핑의 개혁 개방에 대해 서술해 보세요.
	→ 대학을 다시 열고 미국과 교역 시작
	   → 농업개혁, 사유기업 허용, 외국 자본 도입 등
	   → 정치적으로는 사회주의, 경제적으로는 자본주의 사용  
	      → 논리적 모순


 5. 천안문 사태의 발생 배경과 천안문 사태에 대한 평가를 서술해 보세요.
	→ 1. 빈부격차가 심해짐과 동시에 외국 기업의 도입으로 인한 자유민주주의 사상 전파
	      → 대학생을 중심으로 의견을 제시하고 답을 얻어내는 민주적 사고 방식 확장

	   2. 공산당은 많은 이들이 모여 불만을 표한다는 쪽과, 민주주의적으로 해결해야 한다는 쪽으로 나뉨
	      → 후자의 대표격인 후야오방이 사망하자 대학생들은 천안문에서 그를 추모

	   3. 덩샤오핑은 이를 공산당에 대한 위협으로 판단
	      → 천안문 사태 발생, 중국의 정치적 폭력과 국가 전체주의 강화

 ====================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================

 ■ 7장

 1. 중화인민공화국 국가주석에 대해 서술해 보세요.
	→ 당조직 : 시진핑 + 6인

	   전인민대표대회(국회) : 시, 주, 현은 직접 선거
						      성, 시는 간접 선거
							  → 중요한 정책을 여기서 결정한다.

	   8개의 민주당파 : 공산당의 하부 당


 2. 중국의 1~5세대 지도부 인물에 대해 요약 저리해 보세요.
	→ 1세대 : 마오쩌둥

	   2세대 : 덩샤오핑

	   3세대 : 장쩌민
			   → 일을 못하면 자를 수 있게 바꿈  // 빈부격차 UP

	   4세대 : 후진타오
			   → 빈부격차를 줄이기 위해 조화 사회, 삼농 실시
			      → 사유재산을 점, 선, 면으로 넓혀가며 허용

	   5세대 : 시진핑
			   → 연임이 가능하도록 바꿈  // 시진핑의 독재 가능성 발생

 ====================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================

 ■ 8장

 1. 중국적 특색을 지닌 사회주의의 개념을 설명해 보세요.
	→ 마오쩌둥은 경험이 적어 소련의 공산당을 그대로 수용
	   → 이후 중국 공산당이라는 이름을 내걸고 다른 정책을 선보임
	      → 5년마다 5개년 계획을 수립하여 이행


 2. 선부론과 흑묘백묘론에 대해 설명해 보세요.
	→ 선부론 : 일단 돈을 벌자
	   흑묘백묘론 : 사회주의던 자본주의던 발전에 도움이 된다면 수용


 3. 화교의 개념과 화교사회가 형성된 배경에 대해 설명해 보세요.
	→ 중국인의 해외 이주는 매우 많아 아시아권에 매우 강력한 경제망 형성
	   → 덩샤오핑은 이를 이용 : "고향에 투자하라!" + 우대 정책
							     → 화교의 하부에 위치한 이들의 투자 또한 발생하여 매우 많은 투자 발생

*/