/*

 ■ 4장

 1. 중국의 술 문화와 한국의 술 문화를 비교 설명해 보세요.
	→ 우리나라 : 빈 잔에 술을 따른다.
				  건배 이후 자유롭게 마신다.

	   중국 : 잔을 항상 가득 채워놓는다.
			  건배 이후 원샷한다.

	→ 중국의 회사는 모두 국가 소유 : 술의 라벨이 국호 선언 이후로 바뀌지 않았다.

	→ 분류
	   → 바이주 : 마오타이, 우량에
	      황주 : 샤오싱 지방에서 주조
		  혼성주


 2. 발효의 정도에 의해 차를 분류해 보세요.
	→ 불발효 : 뤼차
	   경발효 : 바이차
	   반발효 : 칭차
	   전발효 : 훙차
	   후발효 : 황차, 헤이차

	→ 자사호의 특징
	   → 차의 진액을 흡수하여 축적한다.
		  뜨거운 물로 2~3번 씻어 낸다면 잡냄새가 없어진다.
		  차향을 뺏거나 찻물을 식게 하지 않는다.
	      온도의 적응력이 좋고, 열의 전도성이 낮다.
		  유약을 사용하지 않아 길들일 수 있다.

	→ 중국인은 보온병에 차를 담아 마시는 경우가 많다.
	   중국인은 음식을 매우 존중하여 다른 지역에 가면 항상 음식과 차를 맛본다.

 ====================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================================

 ■ 5장

 1. 춘제, 위안샤오제, 돤우제, 중추제의 풍습을 설명해 보세요.
    → 중화인민공화국 초기에 금지한 것 : 자신들의 전통
										 → 춘절은 사라지지 않았다.
										    → 자오쯔를 만들어 먹는다.
											   세벳돈을 빨간 봉투에 넣어서 준다.
											   복, 춘을 거꾸로 붙이기도 한다.

										 → 중추절은 사라졌다.
										    → 뇌물 문제 심각

	→ 노동절(5.1) : 사회주의의 원칙에 따라 가장 중요한 계급인 노동자의 날

	   국경절(10.1) : 사회주의를 택해 인민을 해방하고 중화인민공화국을 건국한 날


 2. 중국의 혼인풍습에 대해 설명해 보세요.
    → 중화인민공화국 초기에 금지한 것 : 서양 문화
										 → 결혼식을 수행하지 않고, 혼인 신청 후 결혼증을 발급 받는다.
										 
										 → 오늘날에는 과거의 영광을 되찾기 위해 서양 문화와 자신들의 전통 부활
										    → 결혼식을 많이 하며, 축의금을 빨간 봉투에 넣어서 준다.


 3. 중국의 모바일 결제 방식에 대해 서술해보고 우리나라와 비교해 보세요.
    → 진시황 : 화폐 통일

	   신해혁명 : 영국식 화폐와 매우 유사한 화폐 발행
	   
	   1949년 : 중화인민공화국 건국
				→ 마오쩌둥의 업적을 강조하기 위해 모든 화폐에 마오쩌둥을 각인
	   
	   오늘날 : 위챗페이, 츠푸바오 등의 모바일 결제 방식

*/